{"sections":{"main":{"type":"article-template","settings":{"featured_image":"content","wide_display":true,"caption_content_background":"original","blog_breadcrumb":true,"blog_pagination":true,"blog_tags":false,"blog_byline":false,"read_time":true,"blog_date":true,"blog_author":false,"display_social_buttons":false,"blog_comment_count":true,"blog_additional_posts":false,"read_more_link":true,"toggle":false}},"dab64165-db66-4e0d-a2f5-8dd52bbf611a":{"type":"ep-blog-feature-products","blocks":{"template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-0":{"type":"product","settings":{"featured_product":"tadafusa-hocho-kobo-santoku-170mm-hk-2","text":"<p>If you’re buying a gift or getting your first “real” knife, this is the right choice. Tadafusa knives have it all. They’re stylish, lightweight, high-performance, and made with a great deal of care. The thin blades are machine-forged, then completely hand-finished. Every detail is meticulously looked over by the staff at Tadafusa, making these knives the rare affordable masterpiece. Oh, and it’s easy to maintain because the blade is stainless steel inside and out.<\/p>","review":true,"fun-fact-heading":"","fun-fact":""}},"template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-1":{"type":"product","settings":{"featured_product":"fujimoto-nashiji-santoku-165mm","text":"<p>This knife is an up-and-coming hotshot. The Fujimoto Nashiji santoku combines the features of the Masakage Yuki and Koishi lines, at a very agreeable $175 CAD. While this line isn’t the work of a single blacksmith flexing his muscles, the group of craftsmen that make it are definitely pros at their craft. This gives you the benefits of forged steel, with a lower price tag. These are perfect for professional cooks that don’t make corporate-chef dollars or the culinary student picking up their first handmade knife. <\/p>","review":true,"fun-fact-heading":"","fun-fact":""}},"f0ecf7c3-af35-4fe9-a4d3-4481d52de45f":{"type":"product","settings":{"featured_product":"fujimoto-sld-santoku-165mm","text":"<p>The Hammer Tone is another iconic Fujimoto knife, with similar edge retention but higher fit and finish. If you want good looks and low-maintenance, look no further. The Fujimoto Hammer Tone knives feature a gorgeous hammered pattern, all wrapped around a core of SLD stainless steel. This stuff was made for makin’ knives. It cuts incredibly well and stays sharp for ages, but doesn't rust or chip the way carbon steels can.<\/p>","review":true,"fun-fact-heading":"","fun-fact":""}},"814cd114-d077-4c96-9527-02bae8c57776":{"type":"product","disabled":true,"settings":{"featured_product":"masakage-koishi-as-santoku-165mm","text":"","review":true,"fun-fact-heading":"","fun-fact":""}},"88889df0-8812-4097-8230-e21c566d5668":{"type":"product","settings":{"featured_product":"masakage-yuki-santoku-165mm","text":"<p>If you know someone who has a santoku they got from Knifewear, it’s often one of these. Unforunately, they don't come around as often these days, but once upon a time the Yuki and Koishi were our best-selling santokus for good reason. Both feature high performance carbon steel cores, wrapped in a protective layer of stainless. Also, both lines are made by Yoshimi Kato, son-in-law of the original blacksmith who made them, Hiroshi Kato. So, not only are they high performance knives, they are also part of a family tradition. <\/p><p>The Koishi stays sharp longer than the Yuki and is a touch easier to maintain, while the Yuki carries a lower price-tag and sharpens like a dream. Either way, you can’t go wrong. <\/p>","review":true,"fun-fact-heading":"","fun-fact":""}},"6a66a6e1-f21a-4e3e-a58b-196aee924955":{"type":"product","settings":{"featured_product":"haruyuki-mugi-santoku-180mm","text":"<p>The Haruyuki Mugi is good looking, high-performance, and low maintenance. Many folks are more comfortable with the familiar german-style knife handle, and the Mugi offers a more western grip and weight. At only $167, this is the most popular knife for when people are looking for the perfect gift knife.<\/p>","review":true,"fun-fact-heading":"","fun-fact":""}},"c843cf4b-08a9-416a-a171-3bf16700265a":{"type":"product","settings":{"featured_product":"masashi-kuro-damascus-sld-wa-chestnut-santoku-165mm","text":"<p>Now we’re getting into the really fun stuff. Masashi-san is a crazy badass of a blacksmith who forges in slippers and light cigarettes off of 1000 degree steel. He’s incredibly fast at making knives, yet despite his speed they somehow come out better than most. He favours semi-stainless steel, which keeps an edge almost as well as high-carbon steel, but is very difficult to rust. His knives offer the best of both worlds, all in a very sexy package.<\/p>","review":true,"fun-fact-heading":"","fun-fact":""}},"37122cfe-d270-4cb4-b5fc-b9b79eb3d88f":{"type":"product","settings":{"featured_product":"tojiro-atelier-vg10-damascus-santoku-170mm","text":"<p>Of course we had to leave the best for last. The Tojiro Atelier line is the crown jewel of our santoku collection, easily one of the most beautiful blades in our shops. This santoku is fully stainless, with an excessively durable eco-wood handle. The blacksmith behind the knives, Tomoo Matsumura-san, employs the only female apprentice blacksmith that we’ve ever seen in Japan. How great is that? If you’re looking for something that has both great looks and a cool backstory, this is the one to get. <\/p>","review":true,"fun-fact-heading":"","fun-fact":""}}},"block_order":["template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-0","template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-1","f0ecf7c3-af35-4fe9-a4d3-4481d52de45f","814cd114-d077-4c96-9527-02bae8c57776","88889df0-8812-4097-8230-e21c566d5668","6a66a6e1-f21a-4e3e-a58b-196aee924955","c843cf4b-08a9-416a-a171-3bf16700265a","37122cfe-d270-4cb4-b5fc-b9b79eb3d88f"],"settings":{"layout":"large"}},"2edcca56-132f-4cfc-a20a-697fbc0c1b18":{"type":"featured-text","settings":{"title":"","content":"<p>Hopefully this article made it easier, not harder, to pick a Santoku for your collection. I know that with so many great options, choosing can be challenging. If you ever need more help choosing, don’t hesitate to<a href=\"https:\/\/knifewear.com\/#shopify-section-1575997080091\">contact us <\/a>or visit our shops in person. For our full line of santokus, <a href=\"https:\/\/knifewear.com\/collections\/santoku\">you can check out the full selection here.<\/a><\/p>","button_label":"","button_link":"","text_size":"regular_text","text_alignment":"align_left","css_class":"","custom_css":""}},"d0160bd4-7213-4d89-8a14-6fbb1f36f0ac":{"type":"ep-blog-author","settings":{}},"1655832228289470c4":{"type":"featured-blog","settings":{"title":"Other recent Blog posts","blog_widget_select":"articles","home_page_articles":4,"blog_tags":false,"blog_author":false,"read_time":true,"blog_date":true,"blog_comment_count":true,"read_more_link":true,"excerpt_display":"full_excerpt","css_class":"","custom_css":""}}},"order":["main","dab64165-db66-4e0d-a2f5-8dd52bbf611a","2edcca56-132f-4cfc-a20a-697fbc0c1b18","d0160bd4-7213-4d89-8a14-6fbb1f36f0ac","1655832228289470c4"]}