{"sections":{"main":{"type":"article-template","settings":{"featured_image":"content","wide_display":true,"caption_content_background":"original","blog_breadcrumb":true,"blog_pagination":true,"blog_tags":false,"blog_byline":false,"read_time":true,"blog_date":true,"blog_author":false,"display_social_buttons":true,"blog_comment_count":true,"blog_additional_posts":false,"read_more_link":true,"toggle":false}},"dab64165-db66-4e0d-a2f5-8dd52bbf611a":{"type":"ep-blog-feature-products","blocks":{"template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-0":{"type":"product","settings":{"featured_product":"haruyuki-nagisa-santoku-165mm","text":"<p>Oooh, mama. This knife is STUNNING! The octagonal handle locks into my hand like the Power Sword into Megazord’s right fist (look it up). It feels like it doesn’t want to be put down. The gorgeous shiny finish is textured to help food release from the blade, which happens to be made from a spectacular stainless steel called AUS10, which keeps an edge beautifully, but isn't as fussy as some other Japanese steels.<\/p><p>The Santoku is easily one of the most useful blades to have in your kitchen and the first piece of many collections. It's big enough to get just about any job done but small enough to be wielded by anyone. I use mine daily, especially if I'm making a meal for two and don't feel like pulling out a larger knife.<\/p>"}},"template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-1":{"type":"product","settings":{"featured_product":"haruyuki-kokuto-gyuto-240mm","text":"<p>This guy truly has it all. It's classically Japanese in design but requires much less maintenance than traditional Japanese blades. Better yet, the Ginsan steel used in the blade is made to retain an edge similar to high-carbon steel, but it won’t rust! I’m a big fan of a 240mm Gyuto. Something about a big knife makes you feel like a kitchen warlord who can tackle any job thrown your way. I pull out my 240mm gyuto for prepping big meals, handling big squash and cabbage, and slicing large cuts of meat.<\/p>"}},"fa3e1389-3761-45d3-938e-d8b442b5cc6e":{"type":"product","settings":{"featured_product":"haruyuki-mugi-gyuto-210mm","text":"<p>My #1 most-used kitchen knife is a 210mm gyuto. This shape is just so functional! Larger and more capable than the santoku, but less intimidating and unwieldy to home cooks than the 240mm gyuto. I can prep any size of meal with ease, and I never feel like this blade is too big or small.<\/p><p>The Mugi series is one of our best sellers, and it's easy to see why. They have a gorgeous aesthetic and traditional hammer marks combined with a western-style handle that's comfortable and familiar to those new to Japanese cookware. They perform as well as many of our fancier blades but are much easier to care for and tend to be more rugged. If you're after a gift or your first knife, the Mugi is the way to go!<\/p>"}},"f0ecf7c3-af35-4fe9-a4d3-4481d52de45f":{"type":"product","settings":{"featured_product":"haruyuki-shiso-petty-135mm","text":"<p>Small knives get a bad rap. Heck, it took me NINE YEARS of working at Knifewear before I finally bought one! They are underestimated and dismissed due to their size, but boy, are they a game-changer. A mildly skilled cook can do just about anything they set their mind to with a 135mm petty. Personally, I use them for everything from making snacks and breakfast to butchering and trimming meat to using in my home bar. The Shiso isn’t just good looks either; these blades are made from the king of knife steels, Aogami Super. This stuff stays sharp longer than almost any other carbon steel but doesn't rust nearly as quickly!<\/p>"}},"88889df0-8812-4097-8230-e21c566d5668":{"type":"product","settings":{"featured_product":"haruyuki-soba-nakiri-165mm","text":"<p>The first time I used a Nakiri was like the first time I shaved with a straight razor. Immediately after starting, I looked at the blade in my hand and asked: “where have you been all my life”? From that point onward, I found myself reaching for my nakiri over almost any other knife. Let me explain the magic: nakiris are made with a flatter edge than most knives. That means when you cut, you actually get a clean cut because the knife contacts the cutting board properly. No more half-cut stuck-together vegetables in your stir-fry!<\/p><p>The Soba nakiri has a western-style handle, which puts most of the weight in your hand. I love this design because it gives you confidence and control with your knife. <\/p>"}}},"block_order":["template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-0","template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-1","fa3e1389-3761-45d3-938e-d8b442b5cc6e","f0ecf7c3-af35-4fe9-a4d3-4481d52de45f","88889df0-8812-4097-8230-e21c566d5668"],"settings":{}},"2edcca56-132f-4cfc-a20a-697fbc0c1b18":{"type":"featured-text","settings":{"title":"","content":"<p>I think everyone needs a Haruyuki knife in their life. You can’t beat the style, reliability and ruggedness that these blades offer. I hope you love yours just as much as I love mine! If you're like to learn more about Haruyuki knives, <a href=\"https:\/\/knifewear.com\/collections\/haruyuki\">you can check out the whole lineup here.<\/a><\/p><p><a href=\"https:\/\/knifewear.com\/collections\/haruyuki\">Shop All Haruyuki Knives<\/a><\/p><p><\/p>","button_label":"","button_link":"","text_size":"regular_text","text_alignment":"align_left","css_class":"","custom_css":""}},"4d45cf67-37e6-49eb-b4f8-f67282fe7279":{"type":"ep-blog-author","settings":{}},"1655832228289470c4":{"type":"featured-blog","settings":{"title":"Other recent Blog posts","blog_widget_select":"articles","home_page_articles":4,"blog_tags":false,"blog_author":false,"read_time":true,"blog_date":true,"blog_comment_count":true,"read_more_link":true,"excerpt_display":"full_excerpt","css_class":"","custom_css":""}}},"order":["main","dab64165-db66-4e0d-a2f5-8dd52bbf611a","2edcca56-132f-4cfc-a20a-697fbc0c1b18","4d45cf67-37e6-49eb-b4f8-f67282fe7279","1655832228289470c4"]}