{
  "sections": {
    "main": {
      "type": "article-template",
      "settings": {
        "featured_image": "content",
        "wide_display": true,
        "caption_content_background": "original",
        "blog_breadcrumb": true,
        "blog_pagination": true,
        "blog_tags": false,
        "blog_byline": false,
        "read_time": true,
        "blog_date": true,
        "blog_author": false,
        "display_social_buttons": false,
        "blog_comment_count": true,
        "blog_additional_posts": false,
        "read_more_link": true,
        "toggle": false
      }
    },
    "dab64165-db66-4e0d-a2f5-8dd52bbf611a": {
      "type": "ep-blog-feature-products",
      "blocks": {
        "template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-0": {
          "type": "product",
          "settings": {
            "featured_product": "haruyuki-nishiki-santoku-165mm",
            "text": "<p>This is one of the newest lines at Knifewear, first arriving in February 2024. This knife from Haruyuki packs a punch for a killer deal. It’s made with a Shirogami #2 carbon steel core with stainless steel cladding, and I love this combo because it’s perfect for someone who wants a super sharp edge that re-sharpens easily. Plus, the stainless cladding makes it easier to take care of compared to a full carbon steel knife; only the edge of the Nishiki needs to be kept dry to prevent rust. Despite being high carbon steel, it has a more robust edge that makes it a great workhorse. I also love the cherrywood and blonde pakkawood combo on the handle. For some reason, it makes me think about fresh spring air!<\/p>",
            "review": true,
            "fun-fact-heading": "",
            "fun-fact": ""
          }
        },
        "f0ecf7c3-af35-4fe9-a4d3-4481d52de45f": {
          "type": "product",
          "settings": {
            "featured_product": "masashi-kokuen-bunka-165mm",
            "text": "<p>This super sexy, slick knife has been gaining popularity since Masashi-san first launched it and visited Knifewear in summer of 2022. The Kokuen, meaning ‘black smoke’, has quickly become a staff favourite; made with SLD semi-stainless steel, it’s super easy to care for and takes an awesomely sharp edge. I love the Kokuen because they are so thin that they glide through dense carrots and potatoes like nothing. They also have a nice tall profile for my people who like to chop without catching their knuckles on the counter. The dark, smoky finish makes you drool when you look at it, not to mention the reddish-brown ebony handle with a gorgeous water buffalo collar. Make cutting your dense veggies an easy-breezy dream with the Kokuen!<\/p>",
            "review": true,
            "fun-fact-heading": "",
            "fun-fact": ""
          }
        },
        "template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-1": {
          "type": "product",
          "settings": {
            "featured_product": "fujimoto-nashiji-santoku-165mm",
            "text": "<p>Want a smokin’ deal on a Santoku that looks rustic as heck and is made from excellent steel? You need to check on the Fujimoto Nashiji; it’s another staff favourite and beloved by folks looking for their first knife while sticking to a budget. Fujimoto knives are hand-made by a group of artisans that roll-forge their knives, giving many of the benefits of a forged knife in a super consistent, cost-effective package. This knife kicks ass in both professional and home settings, and is great if you want to dip your toes into using carbon steel knives. The core steel, Aogami #2, is less quick to rust than Shirogami (white) carbon steel. Much like the Nishiki, a layer of protective stainless on either side of the blade help keep maintenance down to the very edge of the knife.<\/p>",
            "review": true,
            "fun-fact-heading": "",
            "fun-fact": ""
          }
        },
        "814cd114-d077-4c96-9527-02bae8c57776": {
          "type": "product",
          "disabled": true,
          "settings": {
            "featured_product": "masakage-koishi-as-santoku-165mm",
            "text": "",
            "review": true,
            "fun-fact-heading": "",
            "fun-fact": ""
          }
        },
        "88889df0-8812-4097-8230-e21c566d5668": {
          "type": "product",
          "settings": {
            "featured_product": "masakage-yuki-santoku-165mm",
            "text": "<p>If you know someone who has a santoku they got from Knifewear, it’s often one of these. Unforunately, they don't come around as often these days, but once upon a time the Yuki and Koishi were our best-selling santokus for good reason. Both feature high performance carbon steel cores, wrapped in a protective layer of stainless. Also, both lines are made by Yoshimi Kato, son-in-law of the original blacksmith who made them, Hiroshi Kato. So, not only are they high performance knives, they are also part of a family tradition. <\/p><p>The Koishi stays sharp longer than the Yuki and is a touch easier to maintain, while the Yuki carries a lower price-tag and sharpens like a dream. Either way, you can’t go wrong. <\/p>",
            "review": true,
            "fun-fact-heading": "",
            "fun-fact": ""
          }
        },
        "6a66a6e1-f21a-4e3e-a58b-196aee924955": {
          "type": "product",
          "settings": {
            "featured_product": "haruyuki-mugi-santoku-180mm",
            "text": "<p>The Haruyuki Mugi is good looking, high-performance, and low maintenance. Many folks are more comfortable with the familiar german-style knife handle, and the Mugi offers a more western grip and weight. At only $167, this is the most popular knife for when people are looking for the perfect gift knife.<\/p>",
            "review": true,
            "fun-fact-heading": "",
            "fun-fact": ""
          }
        },
        "c843cf4b-08a9-416a-a171-3bf16700265a": {
          "type": "product",
          "settings": {
            "featured_product": "masashi-kuro-damascus-sld-wa-chestnut-santoku-165mm",
            "text": "<p>Now we’re getting into the really fun stuff. Masashi-san is a crazy badass of a blacksmith who forges in slippers and light cigarettes off of 1000 degree steel. He’s incredibly fast at making knives, yet despite his speed they somehow come out better than most. He favours semi-stainless steel, which keeps an edge almost as well as high-carbon steel, but is very difficult to rust. His knives offer the best of both worlds, all in a very sexy package.<\/p>",
            "review": true,
            "fun-fact-heading": "",
            "fun-fact": ""
          }
        },
        "37122cfe-d270-4cb4-b5fc-b9b79eb3d88f": {
          "type": "product",
          "settings": {
            "featured_product": "tojiro-atelier-vg10-damascus-santoku-170mm",
            "text": "<p>Of course we had to leave the best for last. The Tojiro Atelier line is the crown jewel of our santoku collection, easily one of the most beautiful blades in our shops. This santoku is fully stainless, with an excessively durable eco-wood handle. The blacksmith behind the knives, Tomoo Matsumura-san, employs the only female apprentice blacksmith that we’ve ever seen in Japan. How great is that? If you’re looking for something that has both great looks and a cool backstory, this is the one to get. <\/p>",
            "review": true,
            "fun-fact-heading": "",
            "fun-fact": ""
          }
        }
      },
      "block_order": [
        "template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-0",
        "f0ecf7c3-af35-4fe9-a4d3-4481d52de45f",
        "template--15962749042862__dab64165-db66-4e0d-a2f5-8dd52bbf611a-1669404136d9ce1bd1-1",
        "814cd114-d077-4c96-9527-02bae8c57776",
        "88889df0-8812-4097-8230-e21c566d5668",
        "6a66a6e1-f21a-4e3e-a58b-196aee924955",
        "c843cf4b-08a9-416a-a171-3bf16700265a",
        "37122cfe-d270-4cb4-b5fc-b9b79eb3d88f"
      ],
      "settings": {
        "layout": "large",
        "hide-price": false
      }
    },
    "2edcca56-132f-4cfc-a20a-697fbc0c1b18": {
      "type": "featured-text",
      "settings": {
        "title": "",
        "content": "<p>Hopefully this article made it easier, not harder, to pick a Santoku for your collection. I know that with so many great options, choosing can be challenging. If you ever need more help choosing, don’t hesitate to<a href=\"https:\/\/knifewear.com\/#shopify-section-1575997080091\">contact us <\/a>or visit our shops in person. For our full line of santokus, <a href=\"https:\/\/knifewear.com\/collections\/santoku\">you can check out the full selection here.<\/a><\/p>",
        "button_label": "",
        "button_link": "",
        "text_size": "regular_text",
        "text_alignment": "align_left",
        "css_class": "",
        "custom_css": ""
      }
    },
    "d0160bd4-7213-4d89-8a14-6fbb1f36f0ac": {
      "type": "ep-blog-author",
      "settings": {
      }
    },
    "1655832228289470c4": {
      "type": "featured-blog",
      "settings": {
        "title": "Other recent Blog posts",
        "blog_widget_select": "articles",
        "home_page_articles": 4,
        "blog_tags": false,
        "blog_author": false,
        "read_time": true,
        "blog_date": true,
        "blog_comment_count": true,
        "read_more_link": true,
        "excerpt_display": "full_excerpt",
        "css_class": "",
        "custom_css": ""
      }
    }
  },
  "order": [
    "main",
    "dab64165-db66-4e0d-a2f5-8dd52bbf611a",
    "2edcca56-132f-4cfc-a20a-697fbc0c1b18",
    "d0160bd4-7213-4d89-8a14-6fbb1f36f0ac",
    "1655832228289470c4"
  ]
}
